In [1]:
import pandas as pd
import numpy as np

In [2]:
#Store these 5 tables into a SQL data base called 'movies'
basics = pd.read_csv('Data/title_basics.csv.gz')
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb_API = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [3]:
#Create tables for each data set

In [4]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81670 entries, 0 to 81669
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81670 non-null  object
 1   titleType       81670 non-null  object
 2   primaryTitle    81670 non-null  object
 3   originalTitle   81670 non-null  object
 4   isAdult         81670 non-null  int64
 5   startYear       81670 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81670 non-null  int64
 8   genres          81670 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

In [5]:
#Delete columns: original_title, isAdult, titleType, 
basics = basics.drop(columns = ['originalTitle', 'isAdult', 'titleType'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81670 entries, 0 to 81669
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81670 non-null  object
 1   primaryTitle    81670 non-null  object
 2   startYear       81670 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81670 non-null  int64
 5   genres          81670 non-null  object
dtypes: float64(1), int64(2), object(3)
memory usage: 3.7+ MB

# Creating these tables will be a multi-step process.

Getting a list of all individual genres.
Create a new title_genres table with with the movie ids duplicated, once for each genre that a movie belongs to.
Create a mapper dictionary with numeric ids for each genre.
Use the mapper dictionary to replace the string genres in title_genres with numeric genre_ids.
Convert the mapper dictionary into a final genres table with the numeric genre_id and the string genre.

In [6]:
#Split genres column into genre_id and genre_name
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...
81665,tt9914942,Life Without Sara Amat,2019,NaN,74,Drama,[Drama]
81666,tt9915872,The Last White Witch,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81667,tt9916170,The Rehearsal,2019,NaN,51,Drama,[Drama]
81668,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81669,tt9916362,Coven,2020,NaN,92,"Drama,History","[Drama, History]"

In [7]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...
81668,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller",Action
81668,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller",Adventure
81668,tt9916190,Safeguard,2020,NaN,95,"Action,Adventure,Thriller",Thriller
81669,tt9916362,Coven,2020,NaN,92,"Drama,History",Drama
81669,tt9916362,Coven,2020,NaN,92,"Drama,History",History

In [8]:
genres_split = basics['genres'].str.split(",")
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [9]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [10]:
#Save just tconst and generes_split as new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [11]:
#make the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [12]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres

          tconst genres_split  genre_id
0      tt0035423       Comedy         5
0      tt0035423      Fantasy         9
0      tt0035423      Romance        18
1      tt0062336        Drama         7
2      tt0069049        Drama         7
...          ...          ...       ...
81668  tt9916190       Action         0
81668  tt9916190    Adventure         2
81668  tt9916190     Thriller        23
81669  tt9916362        Drama         7
81669  tt9916362      History        11

[153004 rows x 3 columns]

In [13]:
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002,NaN,126,Drama,[Drama]

In [14]:
#Convert teh genre map dictionary into a dataframe
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})

genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [15]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497338 entries, 0 to 497337
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         497338 non-null  object
 1   averageRating  497338 non-null  float64
 2   numVotes       497338 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

In [16]:
tmdb_API.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2565 entries, 0 to 2564
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2565 non-null   object
 1   adult                  2563 non-null   float64
 2   backdrop_path          1392 non-null   object
 3   belongs_to_collection  206 non-null    object
 4   budget                 2563 non-null   float64
 5   genres                 2563 non-null   object
 6   homepage               173 non-null    object
 7   id                     2563 non-null   float64
 8   original_language      2563 non-null   object
 9   original_title         2563 non-null   object
 10  overview               2512 non-null   object
 11  popularity             2563 non-null   float64
 12  poster_path            2306 non-null   object
 13  production_companies   2563 non-null   object
 14  production_countries   2563 non-null   object
 15  release_date           2545 non-null   object
 16  revenue                2563 non-null   float64
 17  runtime                2563 non-null   float64
 18  spoken_languages       2563 non-null   object
 19  status                 2563 non-null   object
 20  tagline                1097 non-null   object
 21  title                  2563 non-null   object
 22  video                  2563 non-null   float64
 23  vote_average           2563 non-null   float64
 24  vote_count             2563 non-null   float64
 25  certification          814 non-null    object
dtypes: float64(9), object(17)
memory usage: 521.1+ KB

In [17]:
basics.drop(columns='genres_split', inplace=True)
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,NaN,126,Drama

In [18]:
basics.drop(columns=['endYear', 'genres'], inplace=True)

In [19]:
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [20]:
title_genres.head()

      tconst genres_split  genre_id
0  tt0035423       Comedy         5
0  tt0035423      Fantasy         9
0  tt0035423      Romance        18
1  tt0062336        Drama         7
2  tt0069049        Drama         7

In [21]:
#Set tconst as primary key on basics and title_genre tables
max_str_len = basics['tconst'].fillna('').map(len).max()
print(max_str_len)

10

In [22]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1967
1  tt0000002            5.8       264
2  tt0000005            6.2      2610
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [23]:
tmdb_API.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.114,2188.0,PG

In [24]:
cols_to_use = ['imdb_id', 'revenue', 'budget', 'certification']

In [25]:
tmdb_data = tmdb_API[cols_to_use]
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [26]:
from sqlalchemy.types import *
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database

In [27]:
username = 'root'
password = 'root'
db_name = 'Movies'
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)

In [28]:
# check if database exists, if not, create it
if database_exists(connection):
    print('It exists')
else:
    create_database(connection)
    print('Database created!')

It exists

In [29]:
#Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
#Create a schema dictionary using Sqalchemy datatype 
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'runtimeMinutes': Integer()}

In [30]:
basics.to_sql('basics', engine, dtype=basics_schema, if_exists='replace', index=False)

81670

In [31]:
ratings_schema = {'tconst': String(key_len+1),
            'averageRating': Float(),
            'numVotes': Float()}

In [32]:
title_ratings.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists='replace', index=False)

497338

In [33]:
#Add tmdb data
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [34]:
tmdb_data = tmdb_data.loc[ tmdb_data['imdb_id']!='0']
tmdb_data

        imdb_id     revenue      budget certification
1     tt0113026         0.0  10000000.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694  12854953.0    150000.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2560  tt7797670         0.0         0.0           NaN
2561  tt7797790         0.0         0.0           NaN
2562  tt8665056         0.0         0.0           NaN
2563  tt8795764         0.0         0.0            NR
2564  tt9071078         0.0         0.0           NaN

[2563 rows x 4 columns]

In [35]:
tmdb_schema = {'imdb_id': String(key_len+1),
              'revenue': Float(),
              'budget': Float(),
              'certification': Text(title_len+1)}

tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=False)

2563

In [36]:
#Add genres data
genres.head()

genres_schema = {'Genre_Name': Text(title_len+1),
                'Genre_ID': Integer()}

genres.to_sql('genres', engine, dtype=genres_schema, if_exists='replace', index=False)

26

In [37]:
engine.execute('ALTER TABLE basics ADD PRIMARY KEY (`tconst`);')

In [38]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [39]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [40]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')